{
  "kind": "build_request",
  "title": "Center Screen 1 envelope content and fix text layering vs heart seal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "On Screen 1 (envelope scene), ensure the selected envelope content block is visually centered on the screen (not shifted toward the left). Apply this change ONLY to the selected element at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[4]/div[1]/div[1]/div[1]/div[3].",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "place it in the center of the screen. (its place towards the left)"
        ]
      },
      "acceptanceCriteria": [
        "On Screen 1, the selected element’s rendered position is horizontally centered in the viewport on mobile and desktop breakpoints.",
        "No other elements outside the selected XPath are modified as part of this change."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Fix the layering/overlap on Screen 1 so that the \"Hey Love\" and \"14.02.2026\" text is not rendered behind/under the heart emoji (heart seal). Apply this change ONLY to the selected element at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[4]/div[1]/div[1]/div[1]/div[3].",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Hey Love and 14.02.2026 text appears behind the heart emoji"
        ]
      },
      "acceptanceCriteria": [
        "On Screen 1, \"Hey Love\" and \"14.02.2026\" are fully readable and not obscured by the heart seal/emoji.",
        "The fix is achieved by adjusting only the selected element’s styling (e.g., stacking context/z-index/positioning), without changing copy text."
      ]
    }
  ],
  "constraints": [
    "Apply user instructions ONLY to the selected element identified by the provided XPath.",
    "Do not edit files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "All user-facing text must remain in English."
  ],
  "nonGoals": [
    "No changes to Screen 2 (card) or Screen 3 (message) layout or content.",
    "No backend changes.",
    "No new animations or new UI features beyond centering and fixing text/heart overlap."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}