{
  "kind": "build_request",
  "title": "Remove heart CTA and restyle envelope content to look more like a real envelope",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Remove the heart CTA from the envelope by ensuring there is no heart call-to-action element (heart emoji/icon, heart button, or CTA copy) inside the selected envelope content block at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[4]/div[1]/div[1]/div[1]/div[3]. Apply changes ONLY to that selected element.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "remove the heart CTA from the envlope"
        ]
      },
      "acceptanceCriteria": [
        "On Screen 1, the selected content block contains no heart CTA UI (no heart icon/emoji CTA, no heart button, and no CTA-like heart label)",
        "No other elements outside the selected XPath are modified"
      ]
    },
    {
      "id": "REQ-12",
      "text": "Update the styling/structure of the selected envelope content block at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[4]/div[1]/div[1]/div[1]/div[3] so the envelope looks more like a real envelope (e.g., content positioned like an address area rather than a centered headline, subtle address-line treatment). Apply changes ONLY to that selected element.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "make it look more like a envelop"
        ]
      },
      "acceptanceCriteria": [
        "On Screen 1, the content within the selected block is visually styled/positioned to resemble an envelope address area (not a centered CTA-style layout)",
        "The selected block remains readable and does not appear underneath the heart seal (no overlap/obscuring)",
        "No other elements outside the selected XPath are modified"
      ]
    }
  ],
  "constraints": [
    "Apply the requested changes ONLY to the selected element at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[4]/div[1]/div[1]/div[1]/div[3].",
    "All user-facing text must remain in English."
  ],
  "nonGoals": [
    "Do not change any other parts of the envelope (flap/base/heart seal), scene flow, or animations outside the selected element.",
    "Do not introduce any backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}