{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove heart CTA and restyle envelope content to look more like a real envelope",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Remove any heart call-to-action content from the envelope’s selected content block only.",
      "acceptanceCriteria": [
        "On Screen 1, the selected content block contains no heart CTA UI (no heart icon/emoji CTA, no heart button, and no CTA-like heart label)",
        "No other elements outside the selected XPath are modified"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ValentineEnvelopeScene.tsx",
          "operation": "modify",
          "description": "Update ONLY the envelope ‘Content’ block (the div immediately under the comment `/* Content */` inside the envelope) so it contains no heart CTA elements: remove/avoid any heart emoji/icon, heart-themed button, or CTA-style copy within that block, without changing surrounding envelope elements (base/flap/heart seal) or any other scene UI."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Restyle the selected envelope content block only to resemble a real envelope address area and avoid overlap with the heart seal.",
      "acceptanceCriteria": [
        "On Screen 1, the content within the selected block is visually styled/positioned to resemble an envelope address area (not a centered CTA-style layout)",
        "The selected block remains readable and does not appear underneath the heart seal (no overlap/obscuring)",
        "No other elements outside the selected XPath are modified"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ValentineEnvelopeScene.tsx",
          "operation": "modify",
          "description": "Update ONLY the envelope ‘Content’ block (the div immediately under the comment `/* Content */` inside the envelope) to change layout from centered headline to an address-like composition (left-aligned, lower portion of envelope, subtle address-line styling such as small caps/handwritten-like text feel and thin line separators). Ensure the content is positioned to stay clear of the centered heart seal (no overlap) while remaining readable. Do not modify any elements outside this selected content block."
        }
      ]
    }
  ]
}